![title](img/cover4.png)

<center><em>Copyright! This material is protected, please do not copy or distribute.    by:Taher Assaf</em></center>

***
<h1 align="center">Udemy course : Python Bootcamp for Data Science 2021 Numpy Pandas & Seaborn</h1> 

***

## 8.1 Reading Data In Text Format

First we import pandas library:

In [1]:
import pandas as pd

We can read a dataframe from a csv file using the function **pd.read_csv()**:

In [2]:
df1 = pd.read_csv('data/auto1.csv')

W e can display the head of this dataframe using th function **head()**:

In [3]:
df1.head()

                        name  mpg  cylinders  displacement  horsepower
0  chevrolet chevelle malibu   18          8         307.0         130
1          buick skylark 320   15          8         350.0         165
2         plymouth satellite   18          8         318.0         150
3              amc rebel sst   16          8         304.0         150
4                ford torino   17          8         302.0         140

We can read a dataframe from a file where the values are separated by other symbols using the function **pd.read_table()**:

In [4]:
df2 = pd.read_table('data/auto1.csv', sep = ',')

In [5]:
df2.head()

                        name  mpg  cylinders  displacement  horsepower
0  chevrolet chevelle malibu   18          8         307.0         130
1          buick skylark 320   15          8         350.0         165
2         plymouth satellite   18          8         318.0         150
3              amc rebel sst   16          8         304.0         150
4                ford torino   17          8         302.0         140

If the data has no column labels (header), we need to use an argument called **header = None**:

In [6]:
df3 = pd.read_csv('data/auto2.csv', header = None)
df3.head()

                           0   1  2      3    4
0  chevrolet chevelle malibu  18  8  307.0  130
1          buick skylark 320  15  8  350.0  165
2         plymouth satellite  18  8  318.0  150
3              amc rebel sst  16  8  304.0  150
4                ford torino  17  8  302.0  140

If the data has no column labels, we can assign labels for the columns using the argument **names**:

In [7]:
df3 = pd.read_csv('data/auto2.csv', names = ['name', 'mpg', 'cylinders', 'displacement',
                                             'horsepower'])
df3.head()

                        name  mpg  cylinders  displacement  horsepower
0  chevrolet chevelle malibu   18          8         307.0         130
1          buick skylark 320   15          8         350.0         165
2         plymouth satellite   18          8         318.0         150
3              amc rebel sst   16          8         304.0         150
4                ford torino   17          8         302.0         140

***

<h1 align="center">Thank You</h1> 

***